# -*- coding:utf-8 -*-
# print 浮点数
print "浮点数：","floating point number"
#计算浮点型数字和整数的计算区别。

print 3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6
print 3.00 + 2.00 + 1.00 - 5.00 + 4.00 % 2.00 - 1.00 / 4.00 + 6.00
print 3.00 + 2.00 + 1.00 - 5.00 + 4.00 % 2.00 - 1.0 / 4.0 + 6
print 3 + 2 + 1 - 5 + 4 % 2 - 1.0 / 4.0 + 6

print 3.00 + 2 + 1.00 - 5 + 4.00 % 2.00 - 1.0 / 4.0 + 6

# 1／4为整数，结果取0,小数部分舍去.而5.0为浮点数，故输出结果为小数
print '5 + 4 % 2 - 1 / 4 + 6=',5 + 4 % 2 - 1 / 4 + 6
print "5.0 + 4.0 % 2.0 - 1 / 4 + 6=",5.0 + 4.0 % 2.0 - 1 / 4 + 6
print "5.0 + 4 % 2 - 1 / 4 + 6=",5.0 + 4 % 2 - 1 / 4 + 6
print "5.00 + 4.0 % 2.0 - 1 / 4 + 6=",5.00 + 4.0 % 2.0 - 1 / 4 + 6
print "5.00 + 4.0 % 2.0 - 1 / 4 + 6=",5.00 + 4.00 % 2.00 - 1 / 4 + 6

# 有一个常量为浮点数，输出结果皆为浮点数。
print 3/4
print 1/4
print 1.0/4.0
print 1.0/4
print 1.0/4.00
print 1.00/4.0

# print 字符串

print '3 + 2 + 1 - 5 + 4 % 2 - 1 / 4 + 6' 
